Revit 2024 API
ExportPatternInfo Properties
The ExportPatternInfo type exposes the following members.
Properties
Name | Description
DestinationPatternName
 The destination pattern name (the name of the pattern in the exported format).
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ExportPatternInfo Class
Autodesk.Revit.DB Namespace